app/views/shared/_stats.html.erb

    <strong id="following" class="stat">
      <%= @user.microposts.count %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]