app/controllers/static_pages_controller.rb

  def home
    @admins = User.all.where(:admin => true)
    if logged_in?
      @micropost = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."admin" = 't'
SELECT  "microposts".* FROM "microposts" WHERE (user_id = 1)  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships