app/controllers/static_pages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."admin" = 't'
---
  def contact
    @admins = User.all.where(:admin => true)